/****************************************************************************
** $Id: palmyrafm/main.cpp   1.0   edited Jan 4 00:25 $
**
** Copyright (C) 2005 Artem Nahorny.    All rights reserved.
**
** This file is part of the Palmyra File Manager.  This program
** may be used and distributed under the GPL v.2.
**
*****************************************************************************/

/****************************************************************************
** Курсова робота
** студента групи П-01-51 ІП "Стратегія"
** Нагорного Артема
** з дисципліни "Основи Об"єктно Орієнтованого Програмування"
** 
** Тема:
** Створення файлового менеджера під ОС Linux
*****************************************************************************/

// включення заголовочних файлів

#include "palmyrafm.h"

#include <qapplication.h>

// головна функція програми

int main( int argc, char **argv )
{
    // клас програми
    QApplication a( argc, argv );
    // створення вікна допоміжного класу Copier, необхідного для копіювання при перетягуванні файлів чи каталогів
    Copier mywindow;
    // створення головного вікна
    FileMainWindow mw;
    // задання розмірів головному вікну
    mw.resize( 680, 480 );
    // головним віджетом програми призначене головне вікно
    a.setMainWidget( &mw );
    // початкова директорія файлового менеджера - корінний каталог
    mw.fileView()->setDirectory( "/" );
    // показ головного вікна
    mw.show();
    return a.exec();
}
